src/cf/Catalogs/СостоянияЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СостоянияЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеДоставлен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОжидаетОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОтгружен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СостоянияЗаказовПокупателей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Если Не НачальноеЗаполнениеЭлементовВыполнено() Тогда
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = СостоянияЗаказов.СостояниеНеОбработан();
		Элемент.Цвет = Новый ХранилищеЗначения(Новый Цвет(0, 0, 0));
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = СостоянияЗаказов.СостояниеВРаботе();
		Элемент.Цвет = Новый ХранилищеЗначения(Новый Цвет(82, 163, 163));
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = СостоянияЗаказов.СостояниеВыставленСчет();
		Элемент.Цвет = Новый ХранилищеЗначения(Новый Цвет(88, 163, 88));
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = СостоянияЗаказов.СостояниеНаВыполнении();
		Элемент.Цвет = Новый ХранилищеЗначения(Новый Цвет(153, 135, 35));
		
	КонецЕсли;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Завершен";
	Элемент.Наименование = СостоянияЗаказов.СостояниеЗавершен();
	Элемент.Цвет = Новый ХранилищеЗначения(ЦветаСтиля.ПрошедшееСобытие);
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Объект.УстановитьНовыйКод();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Будет удалена в следующей версии.
//
Процедура ЗаполнитьПоставляемыеСостояния() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияЗаказовПокупателей.Ссылка
		|ИЗ
		|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
		|ГДЕ
		|	СостоянияЗаказовПокупателей.Предопределенный = ЛОЖЬ";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		// 1. Состояние "В работе"
		Состояние = Справочники.СостоянияЗаказовПокупателей.СоздатьЭлемент();
		Состояние.Наименование	= НСтр("ru='В работе'");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Состояние);
		
		// 2. Состояние "Завершен"
		Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен.ПолучитьОбъект();
		Состояние.Цвет = Новый ХранилищеЗначения(ЦветаСтиля.ПрошедшееСобытие);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Состояние);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось заполнить справочник ""Состояния заказов покупателей"" по умолчанию по причине:
				|%1'"), 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.СостоянияЗаказовПокупателей, , ТекстСообщения);
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей") Тогда
		Параметры.Вставить("ВидЗаказа", Справочники.ВидыЗаказовПокупателей.Основной);
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	КоличествоЭлементов = 15;
	ДобавлятьПорядок = Истина;
	ИсключатьСостоянияЗаявок = Истина;
	
	Запрос.Текст = ТекстЗапросаПолученияДанныхВыбора(
	Параметры, Запрос, ДобавлятьПорядок, КоличествоЭлементов, ИсключатьСостоянияЗаявок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	НомерПоПорядку = 0;
	ЖирныйШрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);
	
	Пока Выборка.Следующий() Цикл
		
		НомерПоПорядку = НомерПоПорядку + 1;
		Цвет = Выборка.Цвет.Получить();
		Если Цвет = Неопределено Тогда
			Цвет = ЦветаСтиля.ЦветТекстаПоля;
		КонецЕсли;
		
		КомпонентыФС = Новый Массив;
		Если ДобавлятьПорядок Тогда
			
			Если ИсключатьСостоянияЗаявок Тогда
				НомерСостояния = Выборка.НомерСтроки;
			Иначе
				НомерСостояния = НомерПоПорядку;
			КонецЕсли;
			
			КомпонентыФС.Добавить(Строка(НомерСостояния) + ". ");
			
		КонецЕсли;
		
		Если Выборка.Состояние = Завершен Тогда
			Шрифт = ЖирныйШрифт;
		КонецЕсли;
		
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(Выборка.Наименование, Шрифт, Цвет));
		
		ПредставлениеСостояния = Новый ФорматированнаяСтрока(КомпонентыФС);
		ДанныеВыбора.Добавить(Выборка.Состояние, ПредставлениеСостояния);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора
			И Параметры.Свойство("ВидЗаказа") И ЗначениеЗаполнено(Параметры.ВидЗаказа) Тогда
				ВыбраннаяФорма = "Справочник.ВидыЗаказовПокупателей.Форма.ФормаСпискаЭтапов";
	Иначе
		ВыбраннаяФорма = "Справочник.СостоянияЗаказовПокупателей.Форма.ФормаСписка";
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПолученияДанныхВыбора(
	Параметры, Запрос, ДобавлятьПорядок, КоличествоЭлементов, ИсключатьСостоянияЗаявок)
	
	ОтображатьСостоянияЗаявок = Параметры.Свойство("ОтображатьСостоянияЗаявок");
	
	Если Параметры.Свойство("АвтоПодбор") И Параметры.АвтоПодбор = Истина Тогда 
		
		ИсключатьСостоянияЗаявок = Не ОтображатьСостоянияЗаявок
		И РаботаСЗаявками.ЗаявкиИспользуются(, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу);
		
		Если ИсключатьСостоянияЗаявок Тогда
			
			Результат = 
				"ВЫБРАТЬ
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние,
				|	МАКСИМУМ(ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки <= ВидыЗаказовПокупателей.НомерСостоянияЗаявки) КАК ЭтоСостояниеЗаявки
				|ПОМЕСТИТЬ втДоступныеСостоянияЗаказов
				|ИЗ
				|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗаказовПокупателей КАК ВидыЗаказовПокупателей
				|		ПО ВидыЗаказовПокупателейПорядокСостояний.Ссылка = ВидыЗаказовПокупателей.Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние
				|
				|ИМЕЮЩИЕ
				|	МАКСИМУМ(ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки <= ВидыЗаказовПокупателей.НомерСостоянияЗаявки) = ЛОЖЬ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ ПЕРВЫЕ 15
				|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
				|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
				|	СостоянияЗаказовПокупателей.Цвет КАК Цвет
				|ИЗ
				|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
				|ГДЕ
				|	СостоянияЗаказовПокупателей.Наименование ПОДОБНО &Наименование
				|	И НЕ СостоянияЗаказовПокупателей.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.Завершен)
				|	И СостоянияЗаказовПокупателей.Ссылка В
				|			(ВЫБРАТЬ
				|				втДоступныеСостоянияЗаказов.Состояние КАК Состояние
				|			ИЗ
				|				втДоступныеСостоянияЗаказов КАК втДоступныеСостоянияЗаказов)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
			
		Иначе
			
			Результат = 
				"ВЫБРАТЬ ПЕРВЫЕ 15
				|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
				|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
				|	СостоянияЗаказовПокупателей.Цвет КАК Цвет
				|ИЗ
				|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
				|ГДЕ
				|	СостоянияЗаказовПокупателей.Наименование ПОДОБНО &Наименование
				|	И НЕ СостоянияЗаказовПокупателей.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.Завершен)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Наименование", "%" + Параметры.СтрокаПоиска + "%");
		ДобавлятьПорядок = Ложь;
		
	ИначеЕсли Параметры.Свойство("ВидЗаказа") И ЗначениеЗаполнено(Параметры.ВидЗаказа) Тогда
		
		ИсключатьСостоянияЗаявок = Не ОтображатьСостоянияЗаявок
		И РаботаСЗаявками.ЗаявкиИспользуются(Параметры.ВидЗаказа);
		
		Если ИсключатьСостоянияЗаявок Тогда
			
			Результат = 
				"ВЫБРАТЬ ПЕРВЫЕ 15
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние,
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние.Наименование КАК Наименование,
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние.Цвет КАК Цвет,
				|	ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки КАК НомерСтроки
				|ИЗ
				|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
				|ГДЕ
				|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &ВидЗаказа
				|	И ВидыЗаказовПокупателейПорядокСостояний.Состояние.ПометкаУдаления = ЛОЖЬ
				|	И ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки > ВидыЗаказовПокупателейПорядокСостояний.Ссылка.НомерСостоянияЗаявки
				|
				|УПОРЯДОЧИТЬ ПО
				|	ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки";
			
		Иначе
			
			Результат = 
				"ВЫБРАТЬ ПЕРВЫЕ 15
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние,
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние.Наименование КАК Наименование,
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние.Цвет КАК Цвет
				|ИЗ
				|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
				|ГДЕ
				|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &ВидЗаказа
				|	И ВидыЗаказовПокупателейПорядокСостояний.Состояние.ПометкаУдаления = ЛОЖЬ
				|
				|УПОРЯДОЧИТЬ ПО
				|	ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки";
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВидЗаказа", Параметры.ВидЗаказа);
		
	Иначе
		
		ИсключатьСостоянияЗаявок = Не ОтображатьСостоянияЗаявок
		И РаботаСЗаявками.ЗаявкиИспользуются(, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу);
		
		Если ИсключатьСостоянияЗаявок Тогда
			
			Результат = 
				"ВЫБРАТЬ
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние,
				|	МАКСИМУМ(ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки <= ВидыЗаказовПокупателей.НомерСостоянияЗаявки) КАК ЭтоСостояниеЗаявки
				|ПОМЕСТИТЬ втДоступныеСостоянияЗаказов
				|ИЗ
				|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗаказовПокупателей КАК ВидыЗаказовПокупателей
				|		ПО ВидыЗаказовПокупателейПорядокСостояний.Ссылка = ВидыЗаказовПокупателей.Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ВидыЗаказовПокупателейПорядокСостояний.Состояние
				|
				|ИМЕЮЩИЕ
				|	МАКСИМУМ(ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки <= ВидыЗаказовПокупателей.НомерСостоянияЗаявки) = ЛОЖЬ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ ПЕРВЫЕ 15
				|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
				|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
				|	СостоянияЗаказовПокупателей.Цвет КАК Цвет
				|ИЗ
				|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
				|ГДЕ
				|	СостоянияЗаказовПокупателей.Ссылка В
				|			(ВЫБРАТЬ
				|				втДоступныеСостоянияЗаказов.Состояние КАК Состояние
				|			ИЗ
				|				втДоступныеСостоянияЗаказов КАК втДоступныеСостоянияЗаказов)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
			
		Иначе
			
			Результат = 
				"ВЫБРАТЬ ПЕРВЫЕ 15
				|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
				|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
				|	СостоянияЗаказовПокупателей.Цвет КАК Цвет
				|ИЗ
				|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
			
		КонецЕсли;
		
		ДобавлятьПорядок = Ложь;
		
	КонецЕсли;
	
	Возврат СтрЗаменить(Результат, "15", КоличествоЭлементов);
	
КонецФункции

Функция НачальноеЗаполнениеЭлементовВыполнено()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияЗаказовПокупателей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
	|ГДЕ
	|	СостоянияЗаказовПокупателей.Предопределенный = ЛОЖЬ";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
